//начало текста модуля
Перем Ванесса;

// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	//описание параметров
	//пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,
									 "ЯВыгружаюЖРЗаПериодСПоСОтборомПоВКаталогВФайл(Парам01,Парам02,Парам03,Парам04,Парам05)",
									 "ЯВыгружаюЖРЗаПериодСПоСОтборомПоВКаталогВФайл",
	                                 "Допустим Я выгружаю ЖР за период с ""ДатаНачала"" по ""ДатаОкончания"" с отбором по ""УровеньЖурналаРегистрации"" в каталог ""ИмяНовогоКаталога"" в файл ""ИмяФайла""",
	                                 "",
	                                 "");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередНачаломСценария() Экспорт
КонецПроцедуры

Процедура ПередОкончаниемСценария() Экспорт
КонецПроцедуры